
&НаКлиенте
Процедура DRIVER_OPEN(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.OPEN";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура DRIVER_CLOSE(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.CLOSE";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура DRIVER_GET_VERSION(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.GET_VERSION";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура DRIVER_GET_LAST_ERROR(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.GET_LAST_ERROR";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура DRIVER_GET_PARAMETERS(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.GET_PARAMETERS";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура DRIVER_SET_PARAMETER(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.SET_PARAMETER";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура RFID_OPEN_SESSION_RFID(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.OPEN_SESSION_RFID";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура RFID_GET_DATATAGS_RFID(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.GET_DATATAGS_RFID";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура RFID_SAVE_DATATAG_RFID(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.SAVE_DATATAG_RFID";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура RFID_CLOSE_SESSION_RFID(Команда)
	Попытка	
		#Если МобильноеПриложениеКлиент Тогда
			
			НовыйВызов = Новый ЗапускПриложенияМобильногоУстройства();
		    НовыйВызов.Действие = "com.smarts.demodriver1c.CLOSE_SESSION_RFID";
		    Сообщить(НовыйВызов.Запустить(Истина));
		    Для Каждого Стр Из НовыйВызов.ДополнительныеДанные Цикл
		        Сообщить(Стр.Ключ+" - "+Стр.Значение);
		    КонецЦикла;
			
		#КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
